app/controllers/authentications_controller.rb

  def create
    #current_user.authentications.create(:provider => auth ['provider'], :uid => auth['uid'], :token => auth['credentials']['auth_token'])
    omniauth = request.env["omniauth.auth"]
    authentication = Authentication.find_by_provider_and_uid(omniauth['provider'], omniauth['uid'])
    if authentication
      flash[:notice] = "Signed in successfully."
      sign_in_and_redirect(:user, authentication.user)
    elsif current_user
      current_user.authentications.create(:provider => omniauth['provider'], :uid => omniauth['uid'], :token => omniauth['credentials']['token'])
---
SELECT "authentications".* FROM "authentications" WHERE ("authentications"."uid" = '659477511') AND ("authentications"."provider" = 'facebook') LIMIT 1
INSERT INTO "authentications" ("user_id", "uid", "updated_at", "created_at", "token", "provider") VALUES (5, '659477511', '2011-05-12 15:37:02.568867', '2011-05-12 15:37:02.568867', '152221874843333|22600396390bfbb7e0e9dbd3.1-659477511|Ot1ZWVGDCgdK8S6c8GJuW5P9m74', 'facebook')
INSERT INTO "users" ("status", "current_sign_in_at", "updated_at", "facebook_id", "remember_created_at", "created_at", "is_active", "sync_token", "encrypted_password", "remember_token", "last_name", "facebook_access_token", "reset_password_token", "email", "authentication_token", "deleted", "last_sign_in_at", "created_by", "current_sign_in_ip", "profile_image", "last_sign_in_ip", "sign_in_count", "first_name") VALUES (0, NULL, '2011-05-12 15:37:02.566604', NULL, NULL, '2011-05-12 15:37:02.566604', 't', NULL, '$2a$10$NUWEIDK3.eF8w/.1BfFfoe4OTB6lphNo52zPPIZWvNOGcFH60nf4a', NULL, NULL, NULL, NULL, 'djbwise@yahoo.com', NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL)